In [22]:
#casting and handling missing values

In [23]:
import pandas as pd
import numpy as np

In [33]:
people = {
    'First': ['Corey','Jane','John','Chris',np.nan, None, 'NA'],
    'Last': ['Schafer','Doe','Doe','Schafer',np.nan,np.nan, 'Missing'],
    'Email': ['CoreySchafer@gmail.com','JaneDoe@gmail.com','JohnDoe@gmail.com', None, np.nan,'Anonymous@gmail.com','NA'],
    'Age': ['33','55','63','36',None,None,'Missing']
}

In [34]:
df = pd.DataFrame(people)

df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [35]:
df

   First     Last                   Email   Age
0  Corey  Schafer  CoreySchafer@gmail.com    33
1   Jane      Doe       JaneDoe@gmail.com    55
2   John      Doe       JohnDoe@gmail.com    63
3  Chris  Schafer                    None    36
4    NaN      NaN                     NaN  None
5   None      NaN     Anonymous@gmail.com  None
6    NaN      NaN                     NaN   NaN

In [36]:
df.dropna() # if dropna(axis='index',how='any')

   First     Last                   Email Age
0  Corey  Schafer  CoreySchafer@gmail.com  33
1   Jane      Doe       JaneDoe@gmail.com  55
2   John      Doe       JohnDoe@gmail.com  63

In [37]:
df.dropna(axis='index',how='all')

   First     Last                   Email   Age
0  Corey  Schafer  CoreySchafer@gmail.com    33
1   Jane      Doe       JaneDoe@gmail.com    55
2   John      Doe       JohnDoe@gmail.com    63
3  Chris  Schafer                    None    36
5   None      NaN     Anonymous@gmail.com  None

In [38]:
df.dropna(axis ='index', how = 'any', subset = ['Last','Email'])

   First     Last                   Email Age
0  Corey  Schafer  CoreySchafer@gmail.com  33
1   Jane      Doe       JaneDoe@gmail.com  55
2   John      Doe       JohnDoe@gmail.com  63

In [39]:
df.isna()

   First   Last  Email    Age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [41]:
df.fillna(0)

   First     Last                   Email Age
0  Corey  Schafer  CoreySchafer@gmail.com  33
1   Jane      Doe       JaneDoe@gmail.com  55
2   John      Doe       JohnDoe@gmail.com  63
3  Chris  Schafer                       0  36
4      0        0                       0   0
5      0        0     Anonymous@gmail.com   0
6      0        0                       0   0

In [42]:
df['Age'].mean()

TypeError: can only concatenate str (not "int") to str

In [44]:
df['Age'] = df['Age'].astype(float)

In [46]:
df.dtypes

First     object
Last      object
Email     object
Age      float64
dtype: object

In [47]:
df['Age'].mean()

46.75